driver-tests/bpelse/assign/pattern-demo-content-based-router/src/content-based-router.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="content-based-router" targetNamespace="http://j2ee.netbeans.org/wsdl/content-based-router"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/content-based-router" xmlns:ns="http://xml.netbeans.org/schema/content-based-router" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/content-based-router">
            <xsd:import namespace="http://xml.netbeans.org/schema/content-based-router" schemaLocation="content-based-router.xsd"/>
        </xsd:schema>
    </types>
    <message name="get-dataRequest">
        <part name="part1" element="ns:get-data-request"/>
    </message>
    <message name="get-dataResponse">
        <part name="part1" element="ns:get-data-response"/>
    </message>
    <message name="get-dataFault">
        <part name="fault" element="ns:get-data-fault"/>
    </message>
    <portType name="content-based-routerPortType">
        <operation name="get-data">
            <input name="input1" message="tns:get-dataRequest"/>
            <output name="output1" message="tns:get-dataResponse"/>
            <fault name="fault1" message="tns:get-dataFault"/>
        </operation>
    </portType>
    <binding name="content-based-routerBinding" type="tns:content-based-routerPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="get-data">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
            <fault name="fault1">
                <soap:fault use="literal" name="fault1"/>
            </fault>
        </operation>
    </binding>
    <service name="content-based-routerService">
        <port name="content-based-routerPort" binding="tns:content-based-routerBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/content-based-routerService/content-based-routerPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="content-based-router">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="content-based-routerPortTypeRole" portType="tns:content-based-routerPortType"/>
    </plnk:partnerLinkType>
</definitions>
