driver-tests/bpelse/assign/pattern-demo-app/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://xml.netbeans.org/schema/content-based-router">
  <soapenv:Body>
    <con:get-data-request>
      <!--You have a CHOICE of the next 3 items at this level-->
      <con:customer-id>0</con:customer-id>
      <con:phone-id>?10?</con:phone-id>
      <con:phone-number>?string?</con:phone-number>
    </con:get-data-request>
  </soapenv:Body>
</soapenv:Envelope>